<a href="https://colab.research.google.com/github/rupesh743/Danny-Diner/blob/main/SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# **Project** - **Danny_Diner**

In [1]:
# Important Extensions

!pip install -q ipython-sql
%load_ext sql
%sql sqlite://

     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 1.6/1.6 MB 7.4 MB/s eta 0:00:00

In [2]:
# Creating Table

%%sql
CREATE TABLE sales (
  "customer_id" VARCHAR(1),
  "order_date" DATE,
  "product_id" INTEGER
);

INSERT INTO sales
  ("customer_id", "order_date", "product_id")
VALUES
  ('A', '2021-01-01', '1'),
  ('A', '2021-01-01', '2'),
  ('A', '2021-01-07', '2'),
  ('A', '2021-01-10', '3'),
  ('A', '2021-01-11', '3'),
  ('A', '2021-01-11', '3'),
  ('B', '2021-01-01', '2'),
  ('B', '2021-01-02', '2'),
  ('B', '2021-01-04', '1'),
  ('B', '2021-01-11', '1'),
  ('B', '2021-01-16', '3'),
  ('B', '2021-02-01', '3'),
  ('C', '2021-01-01', '3'),
  ('C', '2021-01-01', '3'),
  ('C', '2021-01-07', '3');


CREATE TABLE menu (
  "product_id" INTEGER,
  "product_name" VARCHAR(5),
  "price" INTEGER
);

INSERT INTO menu
  ("product_id", "product_name", "price")
VALUES
  ('1', 'sushi', '10'),
  ('2', 'curry', '15'),
  ('3', 'ramen', '12');


CREATE TABLE members (
  "customer_id" VARCHAR(1),
  "join_date" DATE
);

INSERT INTO members
  ("customer_id", "join_date")
VALUES
  ('A', '2021-01-07'),
  ('B', '2021-01-09');

 * sqlite://
Done.
15 rows affected.
Done.
3 rows affected.
Done.
2 rows affected.

[]

In [3]:
%%sql
Select * from Sales;

 * sqlite://
Done.

[('A', '2021-01-01', 1),
 ('A', '2021-01-01', 2),
 ('A', '2021-01-07', 2),
 ('A', '2021-01-10', 3),
 ('A', '2021-01-11', 3),
 ('A', '2021-01-11', 3),
 ('B', '2021-01-01', 2),
 ('B', '2021-01-02', 2),
 ('B', '2021-01-04', 1),
 ('B', '2021-01-11', 1),
 ('B', '2021-01-16', 3),
 ('B', '2021-02-01', 3),
 ('C', '2021-01-01', 3),
 ('C', '2021-01-01', 3),
 ('C', '2021-01-07', 3)]

In [4]:
%%sql
Select * from menu;

 * sqlite://
Done.

[(1, 'sushi', 10), (2, 'curry', 15), (3, 'ramen', 12)]

In [5]:
%%sql
Select * from members;

 * sqlite://
Done.

[('A', '2021-01-07'), ('B', '2021-01-09')]

**Case Study Questions**

1. What is the total amount each customer spent at the restaurant?

2. How many days has each customer visited the restaurant?

3. What was the first item from the menu purchased by each customer?

4. What is the most purchased item on the menu and how many times was it purchased by all customers?

5. Which item was the most popular for each customer?

6. Which item was purchased first by the customer after they became a member?

7. Which item was purchased just before the customer became a member?

8. What is the total items and amount spent for each member before they became a member?

9. If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?

10. In the first week after a customer joins the program (including their join date)
they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?

## **Total Amount Spent by Each Customer:**

Calculated the total amount spent by each customer by joining the Sales table with the Menu table on the product_id column and grouping the results by customer ID while summing up the prices of purchased items.

In [6]:
%%sql
-- 1. What is the total amount each customer spent at the restaurant?

select
    s.customer_id,
    sum(m.price) as total_amount_spent
from sales s
join menu m on s.product_id = m.product_id
group by s.customer_id;

 * sqlite://
Done.

[('A', 76), ('B', 74), ('C', 36)]

## **Number of Days Visited by Each Customer:**

Determined the number of distinct days each customer visited the restaurant by selecting the customer ID and counting the distinct order dates from the Sales table, grouping the results by customer ID.

In [7]:
%%sql
-- 2. How many days has each customer visited the restaurant?
select
    customer_id,
    count(distinct order_date) as days_visited
from sales
group by customer_id;

 * sqlite://
Done.

[('A', 4), ('B', 6), ('C', 2)]

## **First Item Purchased by Each Customer:**
Identified the first item purchased by each customer by joining the Sales table with the Menu table on the product_id column, grouping the results by customer ID, and selecting the product name of the first item purchased.

In [8]:
%%sql
-- 3. What was the first item from the menu purchased by each customer?

select
    s.customer_id,
    m.product_name as first_item_purchased
from sales s
join menu m on s.product_id = m.product_id
group by s.customer_id;

 * sqlite://
Done.

[('A', 'sushi'), ('B', 'curry'), ('C', 'ramen')]

## **Most Purchased Item on the Menu:**
Identified the most purchased item on the menu by joining the Sales table with the Menu table on the product_id column, grouping the results by product name, and ordering the results by purchase count in descending order, then limiting to the top item.

In [9]:
%%sql
-- 4. What is the most purchased item on the menu and how many times was it purchased by all customers?
select
    m.product_name,
    count(*) as purchase_count
from sales s
join menu m on s.product_id = m.product_id
group by m.product_name
order by purchase_count desc
limit 1;

 * sqlite://
Done.

[('ramen', 8)]

## **Most Popular Item for Each Customer:**
Determined the most popular item for each customer by joining the Sales table with the Menu table on the product_id column, grouping the results by customer ID and product name, and ordering the results by purchase count in descending order.

In [10]:
%%sql
-- 5. Which item was the most popular for each customer?

select
    s.customer_id,
    m.product_name,
    count(m.product_name) as p_count
from sales s
join menu m on m.product_id = s.product_id
group by s.customer_id, m.product_name
order by s.customer_id, p_count
limit 2, 5;

 * sqlite://
Done.

[('A', 'ramen', 3),
 ('B', 'curry', 2),
 ('B', 'ramen', 2),
 ('B', 'sushi', 2),
 ('C', 'ramen', 3)]

## **First Item Purchased After Becoming a Member:**
Identified the first item purchased by each customer after they became a member by joining the Sales table with the Menu table on the product_id column, filtering for purchases after the join date of the member, and grouping the results by customer ID.

In [19]:
%%sql
-- 6. Which item was purchased first by the customer after they became a member?
select customer_id, order_date, product_name
from (
    select
        sales.customer_id,
        sales.order_date,
        menu.product_name,
        row_number() over (partition by sales.customer_id order by sales.order_date) as rn
    from sales
    left join menu on sales.product_id = menu.product_id
    left join members on sales.customer_id = members.customer_id
    where
        (sales.customer_id = 'A' and sales.order_date > '2021-01-07') or
        (sales.customer_id = 'B' and sales.order_date > '2021-01-09')
) subquery
where rn = 1;

 * sqlite://
Done.

[('A', '2021-01-10', 'ramen'), ('B', '2021-01-11', 'sushi')]

## **Item Purchased Just Before Becoming a Member:**
Identified the item purchased just before each customer became a member by joining the Sales table with the Menu table on the product_id column, filtering for purchases before the join date of the member, and grouping the results by customer ID.

In [18]:
%%sql
-- 7. Which item was purchased just before the customer became a member?

select
    s.customer_id,
    m.product_name,
    s.order_date,
    m1.join_date
from sales s
join menu m on s.product_id = m.product_id
join members m1 on s.customer_id = m1.customer_id
where s.order_date < m1.join_date
group by m1.customer_id
order by s.order_date;

 * sqlite://
Done.

[('A', 'sushi', '2021-01-01', '2021-01-07'),
 ('B', 'curry', '2021-01-01', '2021-01-09')]

##**Total Items and Amount Spent Before Becoming a Member:**
Calculated the total items and amount spent for each customer before they became a member by joining the Sales table with the Menu table on the product_id column, filtering for purchases before the join date of the member, and grouping the results by customer ID while summing up the prices of purchased items.

In [17]:
%%sql
-- 8. What is the total items and amount spent for each member before they became a member?

select
    s.customer_id,
    m.product_name,
    s.order_date,
    m1.join_date,
    sum(m.price) as total_spent
from sales s
join menu m on s.product_id = m.product_id
join members m1 on s.customer_id = m1.customer_id
where s.order_date < m1.join_date
group by m1.customer_id
order by s.order_date;

 * sqlite://
Done.

[('A', 'sushi', '2021-01-01', '2021-01-07', 25),
 ('B', 'curry', '2021-01-01', '2021-01-09', 40)]

## **Points Earned by Each Customer:**
Calculated the points earned by each customer based on their purchases, where each $1 spent equates to 10 points and sushi has a 2x points multiplier. Joined the Sales table with the Menu table on the product_id column and applied the points multiplier for sushi purchases.

In [14]:
%%sql
-- 9. If each $1 spent equates to 10 points and sushi has a 2x points multiplier - how many points would each customer have?
select customer_id,
sum(case
    when product_name = 'sushi' then 20 * price
    else 10 * price
end) total_points
from sales s
join menu m
  on s.product_id = m.product_id
group by customer_id;

 * sqlite://
Done.

[('A', 860), ('B', 940), ('C', 360)]

## **Points Earned by Customers After Joining the Program:**
Calculated the points earned by customers A and B in the first week after joining the program, where they earn double points on all items. Joined the Sales table with the Menu table on the product_id column and applied the points multiplier for purchases made within the first week after joining the program.

In [16]:
%%sql
-- 10. In the first week after a customer joins the program (including their join date)
--     they earn 2x points on all items, not just sushi - how many points do customer A and B have at the end of January?

select customer_id,
       sum(case
           when order_date >= join_date and order_date < date(join_date, '+7 days') then 20 * price
           else 10 * price
       end) as total_points
from (
    select s.customer_id,
           s.order_date,
           m.price,
           mem.join_date
    from sales s
    join menu m on s.product_id = m.product_id
    left join members mem on s.customer_id = mem.customer_id
    where s.order_date >= '2021-01-01' and s.order_date < '2021-02-01'
      and (s.customer_id = 'A' or s.customer_id = 'B')
)
group by customer_id;

 * sqlite://
Done.

[('A', 1270), ('B', 720)]